Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/rights_and_conditions/health_and_safety/health_safety_work.html.txt.tmx
Source language: en
Languages: ga

source: It will only give an assessment of compensation where the person responsible is not seeking a decision on liability, or, in other words, where legal issues are not disputed
ga: Ní thabharfaidh an bord measúnú cúitimh ach amháin nuair nach bhfuil an duine atá freagrach ag cuardach cinneadh ar dhliteanas, nó i bhfocail eile, nuair nach bhfuil díospóid faoi cheisteanna dlí

source: All claims involving workplace accidents (employer liability cases) must be submitted to InjuriesBoard.ie before starting legal proceedings
ga: Caithfear gach éileamh a bhaineann le tionóiscí san ionad oibre (cásanna dliteanais fostóra) a chur faoi bhráid InjuriesBoard.ie sula dtosaítear imeachtaí dlí

source: All personal injury claims (excluding medical negligence) must also be submitted to InjuriesBoard.ie
ga: Caithfear gach éileamh um dhíobháil phearsanta (faillí leighis as an áireamh) a chur faoi bhráid InjuriesBoard.ie chomh maith

source: It assesses compensation quickly but doesn't award costs for or against either party
ga: Déanann sé cúiteamh a mheasúnú go pras, ach ní dhéanann siad costais a bhronnadh ar son ceachtar páirtí ná ina gcoinne

source: If either you or your employer rejects the assessment the Board will issue you with an authorisation allowing you to make a claim through the civil courts
ga: Má dhiúltaíonn ceachtar taobh na costais, eiseoidh an Board cead duit chun éileamh tríd na cúirteanna sibhialta a dhéanamh

source: If you wish to make a complaint of victimisation or about your rights under the Safety, Health and Welfare at Work Act you should apply to the Workplace Relations Commission within 6 months of the complaint occurring. You must use the online complaint form available on workplacerelations.ie
ga: Más mian leat gearán a dhéanamh faoi íospairt nó faoi do chearta faoin Acht um Shábháilteacht, Sláinte agus Leas ag an Obair, ba chóir duit iarratas a dhéanamh chuig an gCoimisiún um Chaidreamh san Áit Oibre tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie. Ní mór duit gearán a dhéanamh laistigh de 6 mhí

source: The time limit may be extended for up to a further 6 months, but only where there is a reasonable cause which prevented the complaint being brought within the normal time limit
ga: Is féidir síneadh ama 6 mhí eile a thabhairt duit ach ní dhéanfar é sin mura bhfuil cúinsí réasúnacha ann a chuir cosc ort an gearán a dhéanamh laistigh den gnáth-thréimhse ama
